Repository: losciuto/MyPlaylist
Catalog: lib/l10n/app_*.arb
Languages: it

# settingsTitle
source: Settings
it: Impostazioni

# generalTab
source: General
it: Generale

# metadataTab
source: Metadata Info
it: Info Metadati

# maintenanceTab
source: Backup/Restore
it: Backup/Ripristino

# themeMode
source: Theme
it: Tema

# systemTheme
source: System
it: Sistema

# lightTheme
source: Light
it: Chiaro

# darkTheme
source: Dark
it: Scuro

source: Videos per page
it: Video per pagina

# tmdbApiKeyHint
source: Enter your TMDB API Key
it: Inserisci la tua chiave API di TMDB

# tmdbInfo
source: API Key is required to fetch missing metadata.
it: La chiave API è necessaria per scaricare i metadati mancanti.

source: Player Path
it: Percorso Player

source: Player Selection
it: Selezione Player

source: Player Preset
it: Preset Player

# autoDetectPlayer
source: Auto-Detect
it: Rileva Automaticamente

source: Custom Player
it: Player Personalizzato

source: Test Player
it: Testa Player

# playerDetected
source: Player detected: {name}
it: Player rilevato: {name}

# playerNotFound
source: No player found. Please configure manually.
it: Nessun player trovato. Configura manualmente.

# playerTested
source: Player tested successfully!
it: Player testato con successo!

# playerTestFailed
source: Failed to launch player. Check the path.
it: Impossibile avviare il player. Controlla il percorso.

# vlcPort
source: VLC RC Port
it: Porta RC VLC

# serverEnabled
source: Enable Server
it: Abilita Server

source: Server Port
it: Porta Server

# securityKey
source: Security Key (PSK)
it: Chiave di Sicurezza (PSK)

source: Listen Interface
it: Interfaccia di Ascolto

# backupDescription
source: Save a security copy of the database.
it: Salva una copia di sicurezza del database.

# exportButton
source: Export Backup
it: Esporta Backup

source: Restore Database
it: Ripristina Database

# restoreDescription
source: Restore database from a previous file.
it: Ripristina il database da un file precedente.

# importButton
source: Import Backup
it: Importa Backup

# confirmRestoreTitle
source: Confirm Restore
it: Conferma Ripristino

# confirmRestoreMsg
source: Are you sure you want to overwrite the current database? This cannot be undone.
it: Sei sicuro di voler sovrascrivere il database corrente? L'operazione è irreversibile.

source: Cancel
it: Annulla

source: Confirm
it: Conferma

# dbRestoredMsg
source: Database restored successfully!
it: Database ripristinato con successo!

# errorMsg
source: Error: {error}
it: Errore: {error}

source: Updates
it: Aggiornamenti

source: Check for updates
it: Controlla aggiornamenti

# currentVersion
source: Current version: {version}
it: Versione attuale: {version}

# noUpdates
source: No updates available. You are on the latest version!
it: Nessun aggiornamento disponibile. Hai l'ultima versione!

source: Language
it: Lingua

source: EVENT LOG
it: REGISTRO EVENTI

source: Refresh Log
it: Aggiorna Log

source: Copy Log
it: Copia Log

source: Clear Log
it: Pulisci Log

# logCopied
source: Logs copied to clipboard
it: Log copiati negli appunti

# logCleared
source: Logs cleared
it: Log cancellati

# noLogs
source: No logs available.
it: Nessun log presente.

# logError
source: Error loading logs: {error}
it: Errore caricamento log: {error}

# navDatabase
source: Manage DB
it: Gestione DB

# navScan
source: Scan
it: Scansione

# colTitle
source: Title
it: Titolo

# colPath
source: Path
it: Percorso

# colDuration
source: Duration
it: Durata

# colYear
source: Year
it: Anno

# colDirectors
source: Directors
it: Registi

# colGenres
source: Genres
it: Generi

# colActions
source: Actions
it: Azioni

# searchPlaceholder
source: Search...
it: Cerca...

# btnScan
source: Scan Folder
it: Scansiona Cartella

# btnSelectFolder
source: Select Folder
it: Seleziona Cartella

# remoteControlSubtitle
source: Allows controlling the app via local network
it: Permette di controllare l'app tramite rete locale

# networkHeader
source: NETWORK
it: RETE

# securityHeader
source: SECURITY
it: SICUREZZA

# backupRestoreHeader
source: BACKUP AND RESTORE
it: BACKUP E RIPRISTINO

# backupSuccessMsg
source: Backup saved successfully at: {path}
it: Backup salvato correttamente in: {path}

# backupErrorMsg
source: Backup error: {error}
it: Errore backup: {error}

# invalidDbMsg
source: Please select a valid .db file.
it: Per favore seleziona un file .db valido.

# dbNotFoundMsg
source: Database not found!
it: Database non trovato!

# restoreErrorMsg
source: Restore error: {error}
it: Errore ripristino: {error}

source: TMDB API Key missing!
it: API Key TMDB mancante!

# tmdbNoResults
source: No results found on TMDB.
it: Nessun risultato trovato su TMDB.

# selectMovieTitle
source: Select Movie
it: Seleziona Film

# tmdbSuccessMsg
source: Info downloaded successfully! Restart scan to update.
it: Info scaricate con successo! Riavvia la scansione per aggiornare.

# genericError
source: Error: {error}
it: Errore: {error}

# playButtonLabel
source: PLAY
it: RIPRODUCI

# tmdbInfoButtonLabel
source: TMDB Info
it: Info TMDB

source: No episodes found.
it: Nessun episodio trovato.

# updateAvailableTitle
source: New version available: {version}
it: Nuova versione disponibile: {version}

# updateAvailableHeader
source: A new update is available!
it: È disponibile un nuovo aggiornamento!

# whatsNewHeader
source: What's new in this version:
it: Novità in questa versione:

# downloadButtonLabel
source: Download
it: Scarica

# ignoreButtonLabel
source: Ignore
it: Ignora

# yearLabel
source: Year: {year}
it: Anno: {year}

# stopAllButtonLabel
source: STOP ALL
it: INTERROMPI TUTTO

# generateNfoTmdbLabel
source: Generate NFO (TMDB)
it: Genera NFO (TMDB)

# sectionGenres
source: GENRES
it: GENERI

# sectionPlot
source: PLOT
it: TRAMA

# sectionEpisodes
source: EPISODES
it: EPISODI

# pageOf
source: Page {current} of {total}
it: Pagina {current} di {total}

# skipVideo
source: Skip this video
it: Salta questo video

source: Untitled
it: Senza Titolo

# scanTitle
source: FOLDER SCAN
it: SCANSIONE CARTELLE

# scanDescription
source: Scan folders to update the database with video metadata. It will automatically search for associated .nfo files.
it: Scansiona le cartelle per aggiornare il database con i metadati dei video. Cercherà automaticamente i file .nfo associati.

# scanStats
source: 📊 Scan Statistics
it: 📊 Statistiche Scansione

# scanStatusReady
source: Ready to scan
it: Pronto per la scansione

# scanStatusInit
source: Initializing scan...
it: Inizializzazione scansione...

# videosFoundCount
source: {count, plural, =0{No videos found} =1{1 video found} other{{count} videos found}}
it: {count, plural, =0{Nessun video trovato} =1{1 video trovato} other{{count} video trovati}}

# scanSupportedExt
source: Supported extensions: .mp4, .avi, .mkv, .mov, ...
it: Estensioni supportate: .mp4, .avi, .mkv, .mov, ...

# genPlaylistTitle
source: GENERATE PLAYLIST (videos: {count})
it: GENERA PLAYLIST (video presenti: {count})

# btnRandom
source: 🎲 Random Playlist
it: 🎲 Playlist Casuale

# btnRecent
source: 🕒 Most Recent
it: 🕒 Più Recenti

# btnFiltered
source: 🎲 Filtered Playlist
it: 🎲 Playlist con Filtri

# btnManual
source: ✏️ Manual Selection
it: ✏️ Selezione Manuale

# btnResetSession
source: Reset session history ({count} watched)
it: Resetta cronologia sessione ({count} visti)

# actionsTitle
source: Playlist Actions
it: Azioni Playlist

# btnShowPosters
source: 🎨 Show Posters
it: 🎨 Mostra Poster

# btnExport
source: 💾 Export
it: 💾 Esporta

# openTempFolder
source: Open temp file folder
it: Apri cartella file temporaneo

# logTitle
source: Remote Command Logs
it: Log Comandi Remoti

# logWaiting
source: Waiting...
it: In attesa...

# logLast
source: Last: {command}
it: Ultimo: {command}

# noPlaylist
source: No playlist generated
it: Nessuna playlist generata

# videosCount
source: {count, plural, =0{No videos} =1{1 video} other{{count} videos}}
it: {count, plural, =0{Nessun video} =1{1 video} other{{count} video}}

# currentPlaylist
source: Current playlist: {count, plural, =0{no videos} =1{1 video} other{{count} videos}}
it: Playlist corrente: {count, plural, =0{nessun video} =1{1 video} other{{count} video}}

# playlistExported
source: Playlist exported to {path}
it: Playlist esportata in {path}

# playerStarted
source: External player started: {name}
it: Avviato player esterno: {name}

# folderOpenError
source: Cannot open folder: {error}
it: Impossibile aprire la cartella: {error}

# inputCountTitle
source: Number of videos
it: Numero di video

# inputCountLabel
source: How many videos to include?
it: Quanti video vuoi includere?

# videoCreated
source: Generated playlist of {count, plural, =0{no videos} =1{1 video} other{{count} videos}}.
it: Generata playlist di {count, plural, =0{nessun video} =1{1 video} other{{count} video}}.

# noVideoFound
source: No videos found!
it: Nessun video trovato!

# filterTitle
source: Advanced Playlist Filters
it: Filtri Avanzati Playlist

source: Reset Filters
it: Resetta Filtri

# tabGeneral
source: General
it: Generale

# tabGenres
source: Genres
it: Generi

# tabYears
source: Years
it: Anni

# tabDirectors
source: Directors
it: Registi

# tabActors
source: Actors
it: Attori

# tabSagas
source: Sagas
it: Saghe

source: GENERAL SETTINGS
it: IMPOSTAZIONI GENERALI

# maxVideos
source: Maximum number of videos:
it: Numero massimo di video:

# minRating
source: Minimum Rating:
it: Rating Minimo:

# filterByRating
source: Filter by rating ≥ {rating}
it: Filtra per rating ≥ {rating}

source: Summary
it: Sommario

# includedItemsCount
source: {count, plural, =0{None included} =1{1 included} other{{count} included}}
it: {count, plural, =0{Nessuno incluso} =1{1 incluso} other{{count} inclusi}}

# excludedItemsCount
source: {count, plural, =0{None excluded} =1{1 excluded} other{{count} excluded}}
it: {count, plural, =0{Nessuno escluso} =1{1 escluso} other{{count} esclusi}}

source: No active filters
it: Nessun filtro attivo

# videosFor
source: Videos for {title}: {value}
it: Video per {title}: {value}

# foundVideos
source: Found: {count, plural, =0{no videos} =1{1 video} other{{count} videos}}
it: Trovati: {count, plural, =0{nessun video} =1{1 video} other{{count} video}}

# manualSelectionTitle
source: Manual Video Selection
it: Selezione Manuale Video

# searchHint
source: Search by title, year, director...
it: Cerca per titolo, anno, regista...

# selectedItemsCount
source: {count, plural, =0{None selected} =1{1 selected} other{{count} selected}}
it: {count, plural, =0{Nessuno selezionato} =1{1 selezionato} other{{count} selezionati}}

# visibleCount
source: Total visible: {count, plural, =0{none} =1{1} other{{count}}}
it: Totale visibili: {count, plural, =0{nessuno} =1{1} other{{count}}}

source: Select All Visible
it: Seleziona Tutti Visibili

source: Deselect All
it: Deseleziona Tutti

source: Create Playlist
it: Crea Playlist

# bulkRenameTitle
source: Bulk Rename Titles
it: Rinomina Titoli in Massa

# bulkRenameMsg
source: This operation will search for .nfo files for each video and rename videos to the format "Title (Year)". Both database and video file metadata will be updated. The operation may take some time. Continue?
it: Questa operazione cercherà i file .nfo per ogni video e rinominerà i video nel formato "Titolo (Anno)". Verranno aggiornati sia il database che i metadati dei file video. L'operazione potrebbe richiedere del tempo. Continuare?

source: Start
it: Avvia

# renaming
source: Renaming in progress...
it: Rinomina in corso...

source: Processing:
it: Elaborazione:

# tmdbGenTitle
source: TMDB NFO Generation
it: Generazione NFO da TMDB

# tmdbGenModeMsg
source: Choose generation mode: ⚡ AUTOMATIC: Download the first result found (fastest). 🖐️ INTERACTIVE: Ask to confirm the movie for each video found.
it: Scegli la modalità di generazione: ⚡ AUTOMATICO: Scarica il primo risultato trovato (più veloce). 🖐️ INTERATTIVO: Ti chiede di confermare il film per ogni video trovato.

# tmdbGenAuto
source: ⚡ AUTOMATIC
it: ⚡ AUTOMATICO

# tmdbGenInteractive
source: 🖐️ INTERACTIVE
it: 🖐️ INTERATTIVO

# tmdbClickAuto
source: ⚡ Automatic
it: ⚡ Automatico

# tmdbClickInteractive
source: 🖐️ Interactive
it: 🖐️ Interattivo

# onlyMissingNfo
source: Generate only if .nfo is missing
it: Genera solo se manca il file .nfo

source: Downloading Info...
it: Scaricamento Info...

# genComplete
source: Generation Completed
it: Generazione Completata

# genStats
source: Files created: {created} Skipped/Not found: {skipped} Errors: {errors}
it: File creati: {created} Saltati/Non trovati: {skipped} Errori: {errors}

# confirmDeleteTitle
source: Confirm Deletion
it: Conferma Eliminazione

# confirmDeleteMsg
source: Do you want to delete video "{title}" from database? The physical file will not be removed.
it: Vuoi eliminare il video "{title}" dal database? Il file fisico non verrà rimosso.

source: Delete
it: Elimina

# videoDeleted
source: Video deleted from database
it: Video eliminato dal database

# confirmClearDb
source: Do you want to delete ALL data from the database?
it: Vuoi cancellare TUTTI i dati dal database?

source: Yes, Delete
it: Si, Cancella

# dbCleared
source: Database cleared!
it: Database pulito!

# videoUpdated
source: Video updated successfully
it: Video aggiornato correttamente

# editVideoTitle
source: Edit Video
it: Modifica Video

source: Load from NFO
it: Carica da NFO

source: Download TMDB
it: Scarica TMDB

# pathLabel
source: Path: {path}
it: Percorso: {path}

# sizeLabel
source: Size: {size}
it: Dimensione: {size}

# labelTitle
source: Title
it: Titolo

# labelYear
source: Year
it: Anno

# labelDuration
source: Duration (min)
it: Durata (min)

# labelGenres
source: Genres (comma separated)
it: Generi (separati da virgola)

# labelDirectors
source: Directors
it: Registi

# labelActors
source: Actors (comma separated)
it: Attori (separati da virgola)

# labelPoster
source: Poster Path
it: Path Poster

# labelSagaIndex
source: Saga Index
it: Indice Saga

# labelPlot
source: Plot
it: Trama

# ratingLabel
source: Rating: {rating}
it: Voto: {rating}

source: Update DB only
it: Aggiorna solo DB

# saveAll
source: Save all (File + DB)
it: Salva tutto (File + DB)

source: Required field
it: Campo obbligatorio

# dbUpdatedMsg
source: Database updated (video file untouched)
it: Database aggiornato (senza toccare il file video)

# fileUpdateMsg
source: Updating file...
it: Aggiornamento file in corso...

# successUpdateMsg
source: File and Database updated successfully!
it: File e Database aggiornati con successo!

# errorUpdateMsg
source: File update error (Database updated anyway)
it: Errore aggiornamento file (Database comunque aggiornato)

# nfoLoadedMsg
source: Data loaded from .nfo file!
it: Dati caricati dal file .nfo!

# nfoNotFoundMsg
source: File .nfo not found.
it: File .nfo non trovato.

# nfoErrorMsg
source: Error parsing .nfo file.
it: Errore nel parsing del file .nfo.

# tmdbUpdatedMsg
source: Data updated from TMDB (NFO and assets created)
it: Dati aggiornati da TMDB (NFO e asset creati)

# seriesLabel
source: SERIES
it: SERIE

# noCommandsMsg
source: No commands found.
it: Nessun comando trovato.

# noVideoInDb
source: No videos in database.
it: Nessun video nel database.

# sagaTooltip
source: The name of the movie collection (e.g. Star Wars Collection)
it: Il nome della collezione di film (es. Star Wars Collection)

# sagaIndexTooltip
source: The order of the movie in the collection (1, 2, 3...)
it: L'ordine del film nella collezione (1, 2, 3...)

# infoTitle
source: Information
it: Informazioni

source: Playlist Creator
it: Creatore Playlist

# tmdbGenModeTitle
source: TMDB Generation Mode
it: Modalità Generazione TMDB

source: Cancelling...
it: Annullamento...

# paramsNone
source: No parameters
it: Nessun parametro

# paramsLabel
source: Parameters: {params}
it: Parametri: {params}

source: Author
it: Autore

source: Build Date
it: Data redazione

source: Scan in progress...
it: Scansione in corso...

source: Select folder to scan
it: Seleziona cartella da scansionare

# included
source: Included: {inclusions}
it: Inclusioni: {inclusions}

# excluded
source: Excluded: {exclusions}
it: Esclusioni: {exclusions}

# scanFinishedMsg
source: Scan finished. Found {count} new videos.
it: Scansione terminata. Trovati {count} nuovi video.

# appearanceHeader
source: APPEARANCE
it: ASPETTO

# langIt
source: Italian
it: Italiano

# langEn
source: English
it: Inglese

# defaultPlaylistSizeHelp
source: Default number of videos to propose when creating a playlist
it: Numero di video proposti di default alla creazione di una playlist

# checkButton
source: Check
it: Controlla

# executableHeader
source: EXECUTABLE
it: ESEGUIBILE

# vlcRemoteHeader
source: VLC REMOTE CONTROL
it: CONTROLLO REMOTO VLC

# serverStatusHeader
source: SERVER STATUS
it: STATO SERVER

source: Select destination folder
it: Seleziona cartella di destinazione

# selectBackupFile
source: Select backup file (.db)
it: Seleziona file di backup (.db)

# eventLogHeader
source: EVENT LOG
it: REGISTRO EVENTI

# updateError
source: Error checking for updates: {error}
it: Errore durante il controllo aggiornamenti: {error}

# databaseManagementTitle
source: DATABASE MANAGEMENT
it: GESTIONE DATABASE

# videosInDatabase
source: 🎬 {count, plural, =0{No videos} =1{1 video} other{{count} videos}} in database
it: 🎬 {count, plural, =0{Nessun video} =1{1 video} other{{count} video}} nel database

# searchVideosPlaceholder
source: Search videos...
it: Cerca video...

source: No videos found.
it: Nessun video trovato.

# clearDatabaseButton
source: Clear Database
it: Pulisci Database

# refreshButton
source: Refresh
it: Aggiorna

# renameTitlesButton
source: Rename Titles
it: Rinomina Titoli

# editTooltip
source: Edit
it: Modifica

# deleteTooltip
source: Delete
it: Elimina

# opCancelled
source: Operation Cancelled
it: Operazione Annullata

# opCompleted
source: Operation Completed
it: Operazione Completata

# bulkOpStats
source: Updated: {updated} Skipped: {skipped} Errors: {errors}
it: Aggiornati: {updated} Saltati: {skipped} Errori: {errors}

# openGitHubLabel
source: Open GitHub
it: Apri GitHub

# statsTotalVideos
source: Total Videos
it: Totale Video

# statsMovies
source: Movies
it: Film

# statsSeries
source: Series
it: Serie TV

# statsAvgRating
source: Avg Rating
it: Voto Medio

# statsTopGenres
source: Top Genres
it: Generi Top

# statsVideosByYear
source: Videos by Year
it: Video per Anno

# statsTopSagas
source: Top Sagas/Collections
it: Saghe/Collezioni Top

# exportPlaylistTitle
source: Export Playlist
it: Esporta Playlist

# tabStatistics
source: Statistics
it: Statistiche

# settingsAutoSyncSubtitle
source: Automatically watch scanned folders for changes
it: Monitora automaticamente le cartelle scansionate per modifiche

# settingsWatchedFolders
source: Watched Folders
it: Cartelle Monitorate

# settingsNoWatchedFolders
source: No folders being watched
it: Nessuna cartella monitorata
